In [1]:
import pandas as pd

In [2]:
%pwd

'c:\\Users\\Shyam\\Desktop\\ml-playground\\data_gathering'

In [3]:
df  = pd.read_csv("data/chocolate_sales.csv")
df

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04/01/2022,"$5,320.00",180
1,Van Tuxwell,India,85% Dark Bars,01/08/2022,"$7,896.00",94
2,Gigi Bohling,India,Peanut Butter Cubes,07/07/2022,"$4,501.00",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27/04/2022,"$12,726.00",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24/02/2022,"$13,685.00",184
...,...,...,...,...,...,...
3277,Karlen McCaffrey,Australia,Spicy Special Slims,17/05/2024,"$5,303.58",354
3278,Jehu Rudeforth,USA,White Choc,07/06/2024,"$7,339.32",121
3279,Ches Bonnell,Canada,Organic Choco Syrup,26/07/2024,$616.09,238
3280,Dotty Strutley,India,Eclairs,28/07/2024,"$2,504.62",397
3281,Karlen McCaffrey,India,70% Dark Bites,23/05/2024,"$5,915.87",355

In [13]:
# opening the csv file through url 

import requests
from io import StringIO


url = "https://raw.githubusercontent.com/cs109/2014_data/master/countries.csv"
headers = {"User-Agent":"Mozilla/5.0 (Machintosh; Intel Mac OS X 10:14; rv:66.0) Gecko/20100101 Firefox/66.0"}
req = requests.get(url,headers=headers)
data = StringIO(req.text)

df = pd.read_csv(data)

df.to_csv("countries.csv")

## sep parameter in the read_csv()

In [12]:
# if you want to read .tsv files
df  = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t") 
# df
# if you don't have names for the columns then we can pass list column names to the names parameter to reflect on the data
df = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t",names=['negative-comments'])
df

C:\Users\Shyam\AppData\Local\Temp\ipykernel_33084\2745670572.py:2: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df  = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t")
C:\Users\Shyam\AppData\Local\Temp\ipykernel_33084\2745670572.py:5: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  df = pd.read_csv("data/test_Arabic_tweets_negative_20190413.tsv",sep="/t",names=['negative-comments'])

                                      negative-comments
0            neg\tÿ≠ÿ™Ÿâ ÿßŸÑÿßŸäÿ™ŸàŸÜÿ≤ ÿÆÿ±ÿ®ÿ™ŸàŸá ŸÖŸà ÿµÿßÿ≠ŸäŸÜ ÿßŸÜÿ™Ÿàÿüÿü üò≠
1     neg\tŸàÿßÿ≠ÿØ ÿ™ÿ®ÿπ ÿßŸÑŸÜÿ∏ÿßŸÖ ÿßŸÑÿ≥Ÿàÿ±Ÿä ŸäŸÇŸàŸÑ ÿ£ŸÜ ÿßŸÑŸÖÿÆÿßÿ®ÿ±ÿßÿ™ ...
2     neg\tÿßŸÑŸâ ŸÖÿ™Ÿâ ÿßŸÑÿ™ÿπÿßŸÖŸÑ ÿßŸÑÿ≥ÿ¶ ŸÑŸÑÿÆÿßÿØŸÖÿßÿ™ ŸàÿπÿØŸÖ ÿßÿ≠ÿ™ÿ±ÿßŸÖ...
3                neg\tÿ±ÿßŸäÿ≠ ÿ¨ÿßŸä Ÿä ÿ∑ÿ≠ŸÑÿ®Ÿä üê∏ #ÿßŸÑŸáŸÑÿßŸÑ_ÿßŸÑÿßŸáŸÑŸä
4                               neg\tÿ™ÿ™ŸÖÿ∫ÿ∑ ŸàŸÖÿπŸáÿß ÿ≥ÿØÿßÿπ üò´
...                                                 ...
5776  neg\tÿßŸÑŸÜŸàŸÖ ŸàÿßŸÜÿ™ ŸÖŸÉÿ≥Ÿàÿ± ÿØŸá ÿßÿ≠ÿ≥ÿßÿ≥ ÿ∫ÿ®Ÿä ÿßŸÑŸÑŸä ŸáŸà ŸÖÿ¥ ...
5777  neg\tÿßÿ≥ÿ™ÿ¥ŸáÿßÿØ_ÿßŸÑÿßŸÖÿßŸÖ_ŸÉÿßÿ∏ŸÖ_ÿßŸÑÿ∫Ÿäÿ∏ ÿßŸÑÿ≥ŸÑÿßŸÖ ÿπŸÑŸâ ÿßŸÑŸÖÿπ...
5778                     neg\tÿßŸÜÿß ŸÉŸÜÿ™ ÿßŸÉŸÑ ÿßŸÑÿµÿ≠ŸÜ ÿ®ŸÉÿ®ÿ±Ÿá üòê
5779  neg\tŸÇŸàŸÑŸàÿß ŸÑŸä ÿßŸäÿ¥ ÿ™ÿ¥ŸàŸÅŸàÿß .. ŸÖÿπ ŸÖŸÑÿßÿ≠ÿ∏ÿ© ÿßŸÑÿ™ŸÑÿ∑ŸÅ ŸÑ...
5780  neg\t‚úç ÿ•ÿ∞ÿß ÿ£ÿ±ÿØÿ™ ÿ£ŸÜ ÿ™ÿπÿ±ŸÅ ÿ¥Ÿäÿ¶ÿß ÿπŸÜŸä ÿ•ÿ≥ÿßŸÑŸÜŸä ŸÇÿ®ŸÑ ÿ£ŸÜ...

[5781 rows x 1 columns]

## 1. index_col parameter

In [29]:
df = pd.read_csv("data/countries.csv",index_col="Country")
df = df.drop("Unnamed: 0",axis=1)
df

                  Region
Country
Algeria           AFRICA
Angola            AFRICA
Benin             AFRICA
Botswana          AFRICA
Burkina           AFRICA
...                  ...
Paraguay   SOUTH AMERICA
Peru       SOUTH AMERICA
Suriname   SOUTH AMERICA
Uruguay    SOUTH AMERICA
Venezuela  SOUTH AMERICA

[194 rows x 1 columns]

## 2. Header parameter

In [34]:
# if by mistake the data or the csv file has the first data row as the column names then
# what to do ?

df = pd.read_csv("data/chocolate_sales.csv",header=0) # i can change the header row to any row no
df

,Sales Person,Country,Product,Date,Amount,Boxes Shipped
0,Jehu Rudeforth,UK,Mint Chip Choco,04/01/2022,"$5,320.00",180
1,Van Tuxwell,India,85% Dark Bars,01/08/2022,"$7,896.00",94
2,Gigi Bohling,India,Peanut Butter Cubes,07/07/2022,"$4,501.00",91
3,Jan Morforth,Australia,Peanut Butter Cubes,27/04/2022,"$12,726.00",342
4,Jehu Rudeforth,UK,Peanut Butter Cubes,24/02/2022,"$13,685.00",184
...,...,...,...,...,...,...
3277,Karlen McCaffrey,Australia,Spicy Special Slims,17/05/2024,"$5,303.58",354
3278,Jehu Rudeforth,USA,White Choc,07/06/2024,"$7,339.32",121
3279,Ches Bonnell,Canada,Organic Choco Syrup,26/07/2024,$616.09,238
3280,Dotty Strutley,India,Eclairs,28/07/2024,"$2,504.62",397
3281,Karlen McCaffrey,India,70% Dark Bites,23/05/2024,"$5,915.87",355

## use_cols parameter

In [38]:
# used for only getting the wanted columns and nothing more
df = pd.read_csv("data/chocolate_sales.csv",usecols=["Sales Person","Country","Amount"])
df

          Sales Person    Country      Amount
0       Jehu Rudeforth         UK   $5,320.00
1          Van Tuxwell      India   $7,896.00
2         Gigi Bohling      India   $4,501.00
3         Jan Morforth  Australia  $12,726.00
4       Jehu Rudeforth         UK  $13,685.00
...                ...        ...         ...
3277  Karlen McCaffrey  Australia   $5,303.58
3278    Jehu Rudeforth        USA   $7,339.32
3279      Ches Bonnell     Canada     $616.09
3280    Dotty Strutley      India   $2,504.62
3281  Karlen McCaffrey      India   $5,915.87

[3282 rows x 3 columns]

## squeeze parameter

In [41]:
# if you only want one column then we can use sequence to converet a dataframe to series
# constraint use it only when you need one column

# df = pd.read_csv("data/chocolate_sales.csv",usecols=['Sales Person'],squeeze=True)
# the squeeze parameter is depreciated

ser = pd.read_csv("data/chocolate_sales.csv",usecols=["Sales Person"])["Sales Person"]
ser

0         Jehu Rudeforth
1            Van Tuxwell
2           Gigi Bohling
3           Jan Morforth
4         Jehu Rudeforth
              ...
3277    Karlen McCaffrey
3278      Jehu Rudeforth
3279        Ches Bonnell
3280      Dotty Strutley
3281    Karlen McCaffrey
Name: Sales Person, Length: 3282, dtype: object

## skiprows/nrows parameter

In [8]:
import pandas as pd
df = pd.read_csv("data/aug_test.csv",skiprows=lambda x: x%5 == 0) # removes all the rows with id numbers a multiple of 5
df

,32403,city_41,0.8270000000000001,Male,Has relevent experience,Full time course,Graduate,STEM,9,<10,Unnamed: 10,1,21
0,9858,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,NaN,Pvt Ltd,1,98
1,31806,city_21,0.624,Male,No relevent experience,no_enrollment,High School,NaN,<1,NaN,Pvt Ltd,never,15
2,27385,city_13,0.827,Male,Has relevent experience,no_enrollment,Masters,STEM,11,10/49,Pvt Ltd,1,39
3,217,city_23,0.899,Male,No relevent experience,Part time course,Masters,STEM,10,NaN,NaN,2,12
4,21465,city_21,0.624,NaN,Has relevent experience,no_enrollment,Graduate,STEM,<1,100-500,Pvt Ltd,1,11
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1698,21339,city_21,0.624,Female,No relevent experience,Full time course,High School,NaN,3,NaN,NaN,never,56
1699,195,city_136,0.897,Male,Has relevent experience,no_enrollment,Masters,STEM,18,NaN,NaN,2,30
1700,31762,city_100,0.887,Male,No relevent experience,no_enrollment,Primary School,NaN,3,NaN,Pvt Ltd,never,18
1701,7873,city_102,0.804,Male,Has relevent experience,Full time course,High School,NaN,7,100-500,Public Sector,1,84
1702,12215,city_102,0.804,Male,Has relevent experience,no_enrollment,Masters,STEM,15,10000+,Pvt Ltd,2,11

In [9]:
# if you want to get only a certain number of rows or some specific number of rows then we use nrows
df = pd.read_csv("data/aug_test.csv",nrows=100)
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,32403,city_41,0.827,Male,Has relevent experience,Full time course,Graduate,STEM,9,<10,NaN,1,21
1,9858,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,NaN,Pvt Ltd,1,98
2,31806,city_21,0.624,Male,No relevent experience,no_enrollment,High School,NaN,<1,NaN,Pvt Ltd,never,15
3,27385,city_13,0.827,Male,Has relevent experience,no_enrollment,Masters,STEM,11,10/49,Pvt Ltd,1,39
4,27724,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,72
...,...,...,...,...,...,...,...,...,...,...,...,...,...
95,2934,city_75,0.939,Male,Has relevent experience,no_enrollment,Phd,STEM,>20,1000-4999,Pvt Ltd,3,328
96,12919,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,Humanities,4,NaN,NaN,1,47
97,4386,city_21,0.624,Male,No relevent experience,Full time course,High School,NaN,3,<10,Early Stage Startup,2,36
98,22462,city_21,0.624,NaN,Has relevent experience,no_enrollment,Graduate,STEM,9,10000+,NGO,1,30
99,13988,city_103,0.920,NaN,Has relevent experience,Part time course,Masters,STEM,16,10000+,Pvt Ltd,>4,36

## Encoding parameter

In [12]:
df = pd.read_csv("data/BX-Books.csv",encoding="latin-1") # utf-8 is the default but just in case the default does'nt work try different encoding
df

C:\Users\Shyam\AppData\Local\Temp\ipykernel_30072\2842933254.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("data/BX-Books.csv",encoding="latin-1") # utf-8 is the default but just in case the default does'nt work try different encoding

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company
...,...,...,...,...,...
271374,440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm)
271375,525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books
271376,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco
271377,192126040,Republic (World's Classics),Plato,1996,Oxford University Press
271378,767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages

## skip bad lines

In [17]:
df = pd.read_csv("data/BX-Books.csv",encoding="latin-1",on_bad_lines="skip") 
"""
deprectiated argument
error_bad_lines=False
"""
#if you want to skip the bad line then try the error_bad_lines=False
df

C:\Users\Shyam\AppData\Local\Temp\ipykernel_30072\1201071955.py:1: DtypeWarning: Columns (3) have mixed types. Specify dtype option on import or set low_memory=False.
  df = pd.read_csv("data/BX-Books.csv",encoding="latin-1",on_bad_lines="skip")

,isbn,book_title,book_author,year_of_publication,publisher
0,195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press
1,2005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada
2,60973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial
3,374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux
4,393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company
...,...,...,...,...,...
271374,440400988,There's a Bat in Bunk Five,Paula Danziger,1988,Random House Childrens Pub (Mm)
271375,525447644,From One to One Hundred,Teri Sloat,1991,Dutton Books
271376,006008667X,Lily Dale : The True Story of the Town that Ta...,Christine Wicker,2004,HarperSanFrancisco
271377,192126040,Republic (World's Classics),Plato,1996,Oxford University Press
271378,767409752,A Guided Tour of Rene Descartes' Meditations o...,Christopher Biffle,2000,McGraw-Hill Humanities/Social Sciences/Languages

## dtypes parameter

In [21]:
df = pd.read_csv("data/aug_train.csv",dtype={"target":int}) # convert the datatype of any column you want just by mentioning the column name
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0

## handling dates

In [28]:
df = pd.read_csv("data/IPL Matches 2008-2020.csv",parse_dates=['date']) # if you want to convert the dates from object to proper date foramt
# if you have day / month / year separate but you want it as one column then we can use parse_dates = [["day_col","month_col","year_col"]]
# or parse_dates = {"foo":[1,3,4]}
df

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,Royal Challengers Bangalore,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen
1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri
2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar
3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper
4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
811,1216547,Dubai,2020-09-28,AB de Villiers,Dubai International Cricket Stadium,0,Royal Challengers Bangalore,Mumbai Indians,Mumbai Indians,field,Royal Challengers Bangalore,tie,NaN,Y,NaN,Nitin Menon,PR Reiffel
812,1237177,Dubai,2020-11-05,JJ Bumrah,Dubai International Cricket Stadium,0,Mumbai Indians,Delhi Capitals,Delhi Capitals,field,Mumbai Indians,runs,57.0,N,NaN,CB Gaffaney,Nitin Menon
813,1237178,Abu Dhabi,2020-11-06,KS Williamson,Sheikh Zayed Stadium,0,Royal Challengers Bangalore,Sunrisers Hyderabad,Sunrisers Hyderabad,field,Sunrisers Hyderabad,wickets,6.0,N,NaN,PR Reiffel,S Ravi
814,1237180,Abu Dhabi,2020-11-08,MP Stoinis,Sheikh Zayed Stadium,0,Delhi Capitals,Sunrisers Hyderabad,Delhi Capitals,bat,Delhi Capitals,runs,17.0,N,NaN,PR Reiffel,S Ravi
815,1237181,Dubai,2020-11-10,TA Boult,Dubai International Cricket Stadium,0,Delhi Capitals,Mumbai Indians,Delhi Capitals,bat,Mumbai Indians,wickets,5.0,N,NaN,CB Gaffaney,Nitin Menon

## Convertors

In [29]:
def rename(name):
  if name == "Royal Challengers Bangalore":
    return "RCB"
  return name

In [30]:
rename("Royal Challengers Bangalore")

'RCB'

In [33]:
df = pd.read_csv("data/IPL Matches 2008-2020.csv",converters={'team1':rename})
# if you want to convert the data of some column we can just use the above parameter
df

,id,city,date,player_of_match,venue,neutral_venue,team1,team2,toss_winner,toss_decision,winner,result,result_margin,eliminator,method,umpire1,umpire2
0,335982,Bangalore,2008-04-18,BB McCullum,M Chinnaswamy Stadium,0,RCB,Kolkata Knight Riders,Royal Challengers Bangalore,field,Kolkata Knight Riders,runs,140.0,N,NaN,Asad Rauf,RE Koertzen
1,335983,Chandigarh,2008-04-19,MEK Hussey,"Punjab Cricket Association Stadium, Mohali",0,Kings XI Punjab,Chennai Super Kings,Chennai Super Kings,bat,Chennai Super Kings,runs,33.0,N,NaN,MR Benson,SL Shastri
2,335984,Delhi,2008-04-19,MF Maharoof,Feroz Shah Kotla,0,Delhi Daredevils,Rajasthan Royals,Rajasthan Royals,bat,Delhi Daredevils,wickets,9.0,N,NaN,Aleem Dar,GA Pratapkumar
3,335985,Mumbai,2008-04-20,MV Boucher,Wankhede Stadium,0,Mumbai Indians,Royal Challengers Bangalore,Mumbai Indians,bat,Royal Challengers Bangalore,wickets,5.0,N,NaN,SJ Davis,DJ Harper
4,335986,Kolkata,2008-04-20,DJ Hussey,Eden Gardens,0,Kolkata Knight Riders,Deccan Chargers,Deccan Chargers,bat,Kolkata Knight Riders,wickets,5.0,N,NaN,BF Bowden,K Hariharan
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
811,1216547,Dubai,2020-09-28,AB de Villiers,Dubai International Cricket Stadium,0,RCB,Mumbai Indians,Mumbai Indians,field,Royal Challengers Bangalore,tie,NaN,Y,NaN,Nitin Menon,PR Reiffel
812,1237177,Dubai,2020-11-05,JJ Bumrah,Dubai International Cricket Stadium,0,Mumbai Indians,Delhi Capitals,Delhi Capitals,field,Mumbai Indians,runs,57.0,N,NaN,CB Gaffaney,Nitin Menon
813,1237178,Abu Dhabi,2020-11-06,KS Williamson,Sheikh Zayed Stadium,0,RCB,Sunrisers Hyderabad,Sunrisers Hyderabad,field,Sunrisers Hyderabad,wickets,6.0,N,NaN,PR Reiffel,S Ravi
814,1237180,Abu Dhabi,2020-11-08,MP Stoinis,Sheikh Zayed Stadium,0,Delhi Capitals,Sunrisers Hyderabad,Delhi Capitals,bat,Delhi Capitals,runs,17.0,N,NaN,PR Reiffel,S Ravi
815,1237181,Dubai,2020-11-10,TA Boult,Dubai International Cricket Stadium,0,Delhi Capitals,Mumbai Indians,Delhi Capitals,bat,Mumbai Indians,wickets,5.0,N,NaN,CB Gaffaney,Nitin Menon

## na_values parameter

In [35]:
df = pd.read_csv("data/aug_train.csv",na_values=["Male"]) # if you want to consider some of the categorical value empty in the columns then we can use the parameter
df

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,NaN,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,NaN,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,NaN,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,NaN,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,NaN,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

## loading a huge dataset in chunks

In [36]:
dfs = pd.read_csv("data/aug_train.csv",chunksize=5000)

In [39]:
for chunks in dfs:
  print(chunks.shape)

(5000, 14)
(5000, 14)
(4158, 14)